/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "stm8l15x.h"
#include "dht11.h"


/*******************************************************************************
****函数名称:
****函数功能:ms延时函数
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void delay_ms(int value){
  int i,j;
  if(value<1)
    value = 1;
  for(i=0;i!=value;i++)
    for(j=0;j!=5000;++j);
} 
/*******************************************************************************
****函数名称:
****函数功能:us延时函数
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void Delay_us(u32 nCount)  
{
  char i;
	for(i=0;i<5;i++) 
  {
    while (nCount != 0) 
    {
      nCount--; 
    } 
  } 
}  
/*******************************************************************************
****函数名称:
****函数功能:初始化UART
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void DHT11_Init(void) 
{ 
    GPIO_DeInit(GPIOD);  
    
} 
/*******************************************************************************
****函数名称:
****函数功能:发送开始信号函数
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
unsigned int DHT11_Start(void)
{ 
  DHT11_OUT;      //设置端口方向
  DHT11_CLR;      //拉低端口
  delay_ms(5);   //持续最低18ms
  DHT11_SET;      //释放总线
  //总线由上拉电阻拉高，主机延时30uS;
  Delay_us(22);
  
  DHT11_IN;      //设置端口方向
  
  while(!GPIO_ReadInputDataBit(DHT11_PORT,DHT11_PIN));//DHT11   等待80us低电平响应信号结束
  while(GPIO_ReadInputDataBit(DHT11_PORT,DHT11_PIN));//DHT11   将总线拉高80us
  
  return 1;
}
/*******************************************************************************
****函数名称:
****函数功能:读取DHT11数据
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
unsigned char DHT11_ReadValue(void)
{ 
  unsigned char i,sbuf=0;

  for(i=8;i>0;i--)
  {
    sbuf<<=1; 
    while((!GPIO_ReadInputDataBit(DHT11_PORT,DHT11_PIN)));//50us的开始低电平
    Delay_us(22);// 延时 30us 后检测数据线是否还是高电平 
    if(GPIO_ReadInputDataBit(DHT11_PORT,DHT11_PIN))
    {
      sbuf|=1;  
    }
    else
    {
      sbuf|=0;
    }
    while(GPIO_ReadInputDataBit(DHT11_PORT,DHT11_PIN));
  }
  return sbuf;   
}
/*******************************************************************************
****函数名称:
****函数功能:获取传感器数据函数
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
unsigned char Get_data(unsigned char *buf)
{
  u8 check;

    buf[0]=DHT11_ReadValue();
      
    buf[1]=DHT11_ReadValue();
   
    buf[2]=DHT11_ReadValue();
    
    buf[3]=DHT11_ReadValue();
    
    check =DHT11_ReadValue();

    if(check == buf[0]+buf[1]+buf[2]+buf[3])
        return 1;
    else
        return 0;
} 

